电脑/python/其他内置模块/functools模块.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-02-03 三 16:50 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>functools模块</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">functools模块</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. partial类</a></li>
<li><a href="#orgheadline2">2. update_wrapper函数</a></li>
<li><a href="#orgheadline3">3. wraps装饰器</a></li>
<li><a href="#orgheadline4">4. 参考资料</a></li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline1">partial类</h2>
<div class="outline-text-2" id="text-1">
<p>
functools模块定义了一个partial类，其输入参数如下所示:
</p>

<pre>
functools.partial(func, *args, **keywords)
</pre>

<p>
其将返回一个partial对象，其有 <code>__call__</code> 方法，也就是其可以类似函数进行调用。然后其有 <strong>func</strong> 属性，作为未来函数的调用； <strong>args</strong> 属性，作为未来函数的参数； <strong>keywords</strong> 属性，作为未来函数的可选参数。 简单来说就是partial对原函数对象func进行了封装（所以其特别适合做装饰器）， <code>newfun=partial(func,args,keywords)</code> ，使得调用这个newfun对象就好像调用原func一样，只是加上了额外的参数，其中args非可选参数是类似列表append形式，而keywords可选参数或说关键字参数是类似字典update形式。
</p>

<p>
下面是一个简单的演示例子:
</p>

<div class="highlight"><pre><span class="kn">import</span> <span class="nn">functools</span>

<span class="k">def</span> <span class="nf">fun1</span><span class="p">(</span><span class="n">a</span><span class="p">,</span><span class="n">b</span><span class="o">=</span><span class="mi">2</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="s">&#39;called fun1 with&#39;</span><span class="p">,</span><span class="n">a</span><span class="p">,</span><span class="n">b</span><span class="p">)</span>

<span class="k">def</span> <span class="nf">show_details</span><span class="p">(</span><span class="n">name</span><span class="p">,</span><span class="n">f</span><span class="p">,</span><span class="n">is_partial</span><span class="o">=</span><span class="bp">False</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="n">name</span><span class="p">)</span>
    <span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="p">)</span>
    <span class="k">if</span> <span class="n">is_partial</span><span class="p">:</span>
        <span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="o">.</span><span class="n">func</span><span class="p">)</span>
        <span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="o">.</span><span class="n">args</span><span class="p">)</span>
        <span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="o">.</span><span class="n">keywords</span><span class="p">)</span>
    <span class="k">else</span><span class="p">:</span>
        <span class="k">print</span><span class="p">(</span><span class="n">f</span><span class="o">.</span><span class="n">__name__</span><span class="p">)</span>

<span class="n">show_details</span><span class="p">(</span><span class="s">&#39;fun1&#39;</span><span class="p">,</span><span class="n">fun1</span><span class="p">)</span>

<span class="n">fun1</span><span class="p">(</span><span class="s">&#39;fun1 a&#39;</span><span class="p">)</span>

<span class="n">p1</span> <span class="o">=</span> <span class="n">functools</span><span class="o">.</span><span class="n">partial</span><span class="p">(</span><span class="n">fun1</span><span class="p">,</span><span class="s">&#39;p1 a&#39;</span><span class="p">,</span><span class="n">b</span><span class="o">=</span><span class="mi">99</span><span class="p">)</span>
<span class="n">show_details</span><span class="p">(</span><span class="s">&#39;p1&#39;</span><span class="p">,</span><span class="n">p1</span><span class="p">,</span><span class="bp">True</span><span class="p">)</span>

<span class="n">p1</span><span class="p">()</span>
</pre></div>

<p>
其输出如下:
</p>
<pre>
fun1
&lt;function fun1 at 0xb705880c&gt;
fun1
called fun1 with fun1 a 2
p1
functools.partial(&lt;function fun1 at 0xb705880c&gt;, 'p1 a', b=99)
&lt;function fun1 at 0xb705880c&gt;
('p1 a',)
{'b': 99}
called fun1 with p1 a 99
</pre>

<p>
这里的逻辑是首先正常执行fun1，然后将fun用partial封装成p1，新增参数字符串'p1 a'和b=4，后面我们可以看到这个p1的参数都加进去了。然后执行这个p1我们看到了参数的变化。
</p>
</div>
</div>

<div class="outline-2">
<h2 id="orgheadline2">update_wrapper函数</h2>
<div class="outline-text-2" id="text-2">
<pre>
functools.update_wrapper(wrapper, wrapped, assigned=WRAPPER_ASSIGNMENTS, updated=WRAPPER_UPDATES)
</pre>

<p>
这里参考了 <a href="http://www.wklken.me/posts/2013/08/18/python-extra-functools.html#functoolupdate_wrapper">这个网页</a> 的描述。
</p>

<p>
具体参数暂且不论，就最简单的理解就是前面谈及的partial对象一些必要的参数还没有设置好，这里通过一个目标函数将其处理一下，给予其 <code>__name__</code> ， <code>__doc__</code> 等必要的属性。不过在实际使用的时候我们不需要记住这里是partial对象，wrapper或者wrapped都可以是两个普通的函数对象。
</p>

<div class="highlight"><pre><span class="kn">import</span> <span class="nn">functools</span>

<span class="k">def</span> <span class="nf">wrapped</span><span class="p">(</span><span class="n">a</span><span class="p">,</span> <span class="n">b</span><span class="o">=</span><span class="mi">2</span><span class="p">):</span>
    <span class="sd">&quot;&quot;&quot;Docstring for myfunc().&quot;&quot;&quot;</span>
    <span class="k">print</span><span class="p">(</span><span class="s">&#39;</span><span class="se">\t</span><span class="s">called myfunc with:&#39;</span><span class="p">,</span> <span class="n">a</span><span class="p">,</span> <span class="n">b</span><span class="p">)</span>
    <span class="k">return</span>

<span class="k">def</span> <span class="nf">wrapper</span><span class="p">(</span><span class="n">a</span><span class="p">):</span>
    <span class="k">print</span><span class="p">(</span><span class="s">&#39;wrapper&#39;</span><span class="p">,</span><span class="n">a</span><span class="p">)</span>

<span class="n">p</span> <span class="o">=</span> <span class="n">functools</span><span class="o">.</span><span class="n">update_wrapper</span><span class="p">(</span><span class="n">wrapper</span><span class="p">,</span> <span class="n">wrapped</span><span class="p">)</span>

<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="o">.</span><span class="n">__name__</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="o">.</span><span class="n">__doc__</span><span class="p">)</span>
<span class="k">print</span><span class="p">(</span><span class="n">p</span><span class="p">(</span><span class="mi">1</span><span class="p">))</span>
</pre></div>

<pre>
wrapped
Docstring for myfunc().
wrapper 1
</pre>

<p>
我们看到函数还是原来的那个wrapper函数，但函数的一些内在属性如 <code>__name__</code> 等则被wrapped函数的覆盖了。
</p>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline3">wraps装饰器</h2>
<div class="outline-text-2" id="text-3">
<p>
参考 <a href="http://stackoverflow.com/questions/15357776/what-is-the-difference-between-functools-wraps-and-update-wrapper">这个网页</a> 的描述:
</p>

<p>
这样的形式
</p>
<pre>
@wraps(f)
def g():
    ...
</pre>
<p>
就相当于:
</p>
<pre>
def g():
    ...
g = update_wrapper(g, f)
</pre>

<p>
也就是g就是wrapper，而f是wrapped。
</p>

<p>
在实际应用中，可以将这个函数g做成装饰器函数，如下所示:
</p>

<div class="highlight"><pre><span class="kn">from</span> <span class="nn">functools</span> <span class="kn">import</span> <span class="n">wraps</span>

<span class="k">def</span> <span class="nf">mywrap</span><span class="p">(</span><span class="n">f</span><span class="p">):</span>
    <span class="nd">@wraps</span><span class="p">(</span><span class="n">f</span><span class="p">)</span>
    <span class="k">def</span> <span class="nf">wrapper</span><span class="p">():</span>
        <span class="k">print</span><span class="p">(</span><span class="s">&#39;wrapper&#39;</span><span class="p">)</span>
    <span class="k">return</span> <span class="n">wrapper</span>

<span class="nd">@mywrap</span>
<span class="k">def</span> <span class="nf">wrapped</span><span class="p">(</span><span class="n">a</span><span class="p">,</span> <span class="n">b</span><span class="o">=</span><span class="mi">2</span><span class="p">):</span>
    <span class="sd">&quot;&quot;&quot;Docstring for myfunc().&quot;&quot;&quot;</span>
    <span class="k">print</span><span class="p">(</span><span class="s">&#39;</span><span class="se">\t</span><span class="s">called myfunc with:&#39;</span><span class="p">,</span> <span class="n">a</span><span class="p">,</span> <span class="n">b</span><span class="p">)</span>
    <span class="k">return</span>
</pre></div>

<p>
这里的mywrap装饰器作用于wrapped函数之后，其除了 <code>__name__</code> 等属性还在之外，其他函数执行的方法都被mywrap里面定义的wrapper函数给覆盖了。
</p>
</div>
</div>




<div class="outline-2">
<h2 id="orgheadline4">参考资料</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://docs.python.org/3.4/library/functools.html">functools模块官方文档</a></li>
<li><a href="http://pymotw.com/2/functools/">pymotw网站</a></li>
</ol>
</div>
</div>
</div>
</body>
</html>
